Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ثم أولى لك فأولى
en: Again, woe to you [O man (disbeliever)]! And then (again) woe to you!

source: أيحسب الإنسان أن يترك سدى
en: Does man think that he will be left neglected (without being punished or rewarded for the obligatory duties enjoined by his Lord Allah on him)?

source: ألم يك نطفة من مني يمنى
en: Was he not a Nutfah (mixed male and female sexual discharge) of semen emitted (poured forth)?

source: ثم كان علقة فخلق فسوى
en: Then he became an 'Alaqah (a clot); then (Allah) shaped and fashioned (him) in due proportion.

source: فجعل منه الزوجين الذكر والأنثى
en: And made of him two sexes, male and female.

source: أليس ذلك بقادر على أن يحيي الموتى
en: Is not He (Allah Who does that) Able to give life to the dead? (Yes! He is Able to do all things).

source: هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا
en: Has there not been over man a period of time, when he was not a thing worth mentioning?

source: إنا خلقنا الإنسان من نطفة أمشاج نبتليه فجعلناه سميعا بصيرا
en: Verily, We have created man from Nutfah (drops) of mixed semen (sexual discharge of man and woman), in order to try him: so We made him hearer and seer.

source: إنا هديناه السبيل إما شاكرا وإما كفورا
en: Verily, We showed him the way, whether he be grateful or ungrateful.

source: إنا أعتدنا للكافرين سلاسل وأغلالا وسعيرا
en: Verily, We have prepared for the disbelievers iron chains, iron collars, and a blazing Fire.

source: إن الأبرار يشربون من كأس كان مزاجها كافورا
en: Verily,, the Abrar (the pious believers of Islamic Monotheism), shall drink of a cup mixed with (water from a spring in Paradise called) Kafur

source: عينا يشرب بها عباد الله يفجرونها تفجيرا
en: A spring wherefrom the slaves of Allah will drink, causing it to gush forth abundantly.

source: يوفون بالنذر ويخافون يوما كان شره مستطيرا
en: They (are those who) fulfil (their) vows, and they fear a Day whose evil will be wide-spreading.

source: ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا
en: And they give food, inspite of their love for it (or for the love of Him), to the Miskin (the poor), the orphan, and the captive

source: إنما نطعمكم لوجه الله لا نريد منكم جزاء ولا شكورا
en: (Saying): "We feed you seeking Allah's Countenance only. We wish for no reward, nor thanks from you.

source: إنا نخاف من ربنا يوما عبوسا قمطريرا
en: "Verily, We fear from our Lord a Day, hard and distressful, that will make the faces look horrible (from extreme dislike to it)."

source: فوقاهم الله شر ذلك اليوم ولقاهم نضرة وسرورا
en: So Allah saved them from the evil of that Day, and gave them Nadrah (a light of beauty) and joy.

source: وجزاهم بما صبروا جنة وحريرا
en: And their recompense shall be Paradise, and silken garments, because they were patient.

source: متكئين فيها على الأرائك لا يرون فيها شمسا ولا زمهريرا
en: Reclining therein on raised thrones, they will see there neither the excessive heat of the sun, nor the excessive bitter cold, (as in Paradise there is no sun and no moon).

source: ودانية عليهم ظلالها وذللت قطوفها تذليلا
en: And the shade thereof is close upon them, and the bunches of fruit thereof will hang low within their reach.

source: ويطاف عليهم بآنية من فضة وأكواب كانت قواريرا
en: And amongst them will be passed round vessels of silver and cups of crystal -

source: قوارير من فضة قدروها تقديرا
en: Crystal-clear, made of silver. They will determine the measure thereof (according to their wishes).

source: ويسقون فيها كأسا كان مزاجها زنجبيلا
en: And they will be given to drink there of a cup (of wine) mixed with Zanjabil (ginger),

source: عينا فيها تسمى سلسبيلا
en: A spring there, called Salsabil.

source: ويطوف عليهم ولدان مخلدون إذا رأيتهم حسبتهم لؤلؤا منثورا
en: And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls.

source: وإذا رأيت ثم رأيت نعيما وملكا كبيرا
en: And when you look there (in Paradise), you will see a delight (that cannot be imagined), and a great dominion.

source: عاليهم ثياب سندس خضر وإستبرق وحلوا أساور من فضة وسقاهم ربهم شرابا طهورا
en: Their garments will be of fine green silk, and gold embroidery. They will be adorned with bracelets of silver, and their Lord will give them a pure drink.

source: إن هذا كان لكم جزاء وكان سعيكم مشكورا
en: (And it will be said to them): "Verily, this is a reward for you, and your endeavour has been accepted."

source: إنا نحن نزلنا عليك القرآن تنزيلا
en: Verily, it is We Who have sent down the Qur'an to you (O Muhammad صلى الله عليه وسلم) by stages.

source: فاصبر لحكم ربك ولا تطع منهم آثما أو كفورا
en: Therefore be patient (O Muhammad صلى الله عليه وسلم) with constancy to the Command of your Lord (Allah, by doing your duty to Him and by conveying His Message to mankind), and obey neither a sinner nor a disbeliever among them.

source: واذكر اسم ربك بكرة وأصيلا
en: And remember the Name of your Lord every morning and afternoon [i.e. offering of the Morning (Fajr), Zuhr, and 'Asr prayers].

source: ومن الليل فاسجد له وسبحه ليلا طويلا
en: And during night, prostrate yourself to Him (i.e. the offering of Maghrib and 'Isha' prayers), and glorify Him a long night through (i.e. Tahajjud prayer).

source: إن هؤلاء يحبون العاجلة ويذرون وراءهم يوما ثقيلا
en: Verily, these (disbelievers) love the present life of this world, and put behind them a heavy Day (that will be hard).

source: نحن خلقناهم وشددنا أسرهم وإذا شئنا بدلنا أمثالهم تبديلا
en: It is We Who created them, and We have made them of strong built. And when We will, We can replace them with others like them with a complete replacement.

source: وما تشاءون إلا أن يشاء الله إن الله كان عليما حكيما
en: But you cannot will, unless Allah wills. Verily, Allah is Ever All-Knowing, All-Wise.

source: يدخل من يشاء في رحمته والظالمين أعد لهم عذابا أليما
en: He will admit to His Mercy whom He wills and as for the Zalimun - (polytheists, wrong-doers) He has prepared a painful torment.

source: والمرسلات عرفا
en: By the winds (or angels or the Messengers of Allah) sent forth one after another.

source: فالعاصفات عصفا
en: And by the winds that blow violently.

source: والناشرات نشرا
en: And by the winds that scatter clouds and rain.

source: فالفارقات فرقا
en: And by the Verses (of the Qur'an) that separate the right from the wrong.

source: فالملقيات ذكرا
en: And by the angels that bring the revelations to the Messengers,

source: عذرا أو نذرا
en: To cut off all excuses or to warn.

source: إنما توعدون لواقع
en: Surely, what you are promised must come to pass.

source: فإذا النجوم طمست
en: Then when the stars lose their lights.

source: وإذا السماء فرجت
en: And when the heaven is cleft asunder.

source: وإذا الجبال نسفت
en: And when the mountains are blown away.

source: وإذا الرسل أقتت
en: And when the Messengers are gathered to their time appointed.

source: لأي يوم أجلت
en: For what Day are these signs postponed?

source: ليوم الفصل
en: For the Day of Sorting Out (the men of Paradise from the men destined for Hell).

source: وما أدراك ما يوم الفصل
en: And what will explain to you what is the Day of Sorting Out?

source: ويل يومئذ للمكذبين
en: Woe that Day to the deniers (of the Day of Resurrection)!

source: ألم نهلك الأولين
en: Did We not destroy the ancients?

source: ثم نتبعهم الآخرين
en: So shall We make later generations to follow them.

source: كذلك نفعل بالمجرمين
en: Thus do We deal with the Mujrimun (polytheists, disbelievers, sinners, criminals).

source: ألم نخلقكم من ماء مهين
en: Did We not create you from a despised water (semen)?

source: فجعلناه في قرار مكين
en: Then We placed it in a place of safety (womb),

source: إلى قدر معلوم
en: For a known period (determined by gestation)?

source: فقدرنا فنعم القادرون
en: So We did measure; and We are the Best to measure (the things).

source: ألم نجعل الأرض كفاتا
en: Have We not made the earth a receptacle

source: أحياء وأمواتا
en: For the living and the dead?

source: وجعلنا فيها رواسي شامخات وأسقيناكم ماء فراتا
en: And have placed therein firm, and tall mountains, and have given you to drink sweet water?

source: انطلقوا إلى ما كنتم به تكذبون
en: (It will be said to the disbelievers): "Depart you to that which you used to deny!

source: انطلقوا إلى ظل ذي ثلاث شعب
en: "Depart you to a shadow (of Hell-Fire smoke ascending) in three columns,

source: لا ظليل ولا يغني من اللهب
en: Neither shady, nor of any use against the fierce flame of the Fire."

source: إنها ترمي بشرر كالقصر
en: Verily, it (Hell) throws sparks (huge) as Al-Qasr (a fort or a huge log of wood),

source: كأنه جمالت صفر
en: As if they were yellow camels or bundles of ropes.

source: هذا يوم لا ينطقون
en: That will be a Day when they shall not speak (during some part of it),

source: ولا يؤذن لهم فيعتذرون
en: And they will not be permitted to put forth any excuse.

source: هذا يوم الفصل جمعناكم والأولين
en: That will be a Day of Decision! We have brought you and the men of old together!

source: فإن كان لكم كيد فكيدون
en: So if you have a plot, use it against Me (Allah جل جلاله)!

source: إن المتقين في ظلال وعيون
en: Verily, the Muttaqun (the pious. See V.2:2) shall be amidst shades and springs.

source: وفواكه مما يشتهون
en: And fruits, such as they desire.

source: كلوا وتمتعوا قليلا إنكم مجرمون
en: (O you disbelievers)! Eat and enjoy yourselves (in this worldly life) for a little while. Verily, you are the Mujrimun (polytheists, disbelievers, sinners, criminals).

source: وإذا قيل لهم اركعوا لا يركعون
en: And when it is said to them: "Bow down yourself (in prayer)!" They bow not down (offer not their prayers).

source: فبأي حديث بعده يؤمنون
en: Then in what statement after this (the Qur'an) will they believe?

source: عم يتساءلون
en: What are they asking (one another) about?

source: عن النبإ العظيم
en: About the great news, (i.e. Islamic Monotheism, the Qur'an, which Prophet Muhammad صلى الله عليه وسلم brought and the Day of Resurrection)

source: الذي هم فيه مختلفون
en: About which they are in disagreement.

source: كلا سيعلمون
en: Nay, they will come to know!

source: ثم كلا سيعلمون
en: Nay, again, they will come to know!

source: ألم نجعل الأرض مهادا
en: Have We not made the earth as a bed,

source: والجبال أوتادا
en: And the mountains as pegs?

source: وخلقناكم أزواجا
en: And We have created you in pairs (male and female, tall and short, good and bad, etc.).

source: وجعلنا نومكم سباتا
en: And We have made your sleep as a thing for rest.

source: وجعلنا الليل لباسا
en: And We have made the night as a covering (through its darkness),

source: وجعلنا النهار معاشا
en: And We have made the day for livelihood.

source: وبنينا فوقكم سبعا شدادا
en: And We have built above you seven strong (heavens),

source: وجعلنا سراجا وهاجا
en: And We have made (therein) a shining lamp (sun).

source: وأنزلنا من المعصرات ماء ثجاجا
en: And We have sent down from the rainy clouds abundant water.

source: لنخرج به حبا ونباتا
en: That We may produce therewith corn and vegetations,

source: وجنات ألفافا
en: And gardens of thick growth.

source: إن يوم الفصل كان ميقاتا
en: Verily, the Day of Decision is a fixed time,

source: يوم ينفخ في الصور فتأتون أفواجا
en: The Day when the Trumpet will be blown, and you shall come forth in crowds (groups after groups). [Tafsir At-Tabari]

source: وفتحت السماء فكانت أبوابا
en: And the heaven shall be opened, and it will become as gates,

source: وسيرت الجبال فكانت سرابا
en: And the mountains shall be moved away from their places and they will be as if they were a mirage.

source: إن جهنم كانت مرصادا
en: Truly, Hell is a place of ambush -

source: للطاغين مآبا
en: A dwelling place for the Taghun (those who transgress the boundary limits set by Allah like polytheists, disbelievers in the Oneness of Allah, hyprocrites, sinners, criminals),

source: لابثين فيها أحقابا
en: They will abide therein for ages.

source: لا يذوقون فيها بردا ولا شرابا
en: Nothing cool shall they taste therein, nor any drink.

source: إلا حميما وغساقا
en: Except boiling water, and dirty wound discharges -

source: جزاء وفاقا
en: An exact recompense (according to their evil crimes).

source: إنهم كانوا لا يرجون حسابا
en: For verily, they used not to look for a reckoning.

source: وكذبوا بآياتنا كذابا
en: But they belied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, and that which Our Prophet صلى الله عليه وسلم brought) completely.

source: وكل شيء أحصيناه كتابا
en: And all things We have recorded in a Book.

source: فذوقوا فلن نزيدكم إلا عذابا
en: So taste you (the results of your evil actions). No increase shall We give you, except in torment.

source: إن للمتقين مفازا
en: Verily, for the Muttaqun, there will be a success (Paradise);

source: حدائق وأعنابا
en: Gardens and vineyards,

source: وكواعب أترابا
en: And young full-breasted (mature) maidens of equal age,

source: وكأسا دهاقا
en: And a full cup (of wine).

source: لا يسمعون فيها لغوا ولا كذابا
en: No Laghw (dirty, false, evil talk) shall they hear therein, nor lying;

source: جزاء من ربك عطاء حسابا
en: A reward from your Lord, an ample calculated gift (according to the best of their good deeds),

source: رب السماوات والأرض وما بينهما الرحمن لا يملكون منه خطابا
en: (From) the Lord of the heavens and the earth, and whatsoever is in between them, the Most Gracious, with Whom they cannot dare to speak (on the Day of Resurrection except by His Leave).

source: يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا
en: The Day that Ar-Ruh [Jibril (Gabriel) or another angel] and the angels will stand forth in rows, they will not speak except him whom the Most Gracious (Allah) allows, and he will speak what is right.

source: ذلك اليوم الحق فمن شاء اتخذ إلى ربه مآبا
en: That is (without doubt) the True Day. So, whosoever wills, let him seek a place with (or a way to) His Lord (by obeying Him in this worldly life)!

source: إنا أنذرناكم عذابا قريبا يوم ينظر المرء ما قدمت يداه ويقول الكافر يا ليتني كنت ترابا
en: Verily, We have warned you of a near torment - the Day when man will see that (the deeds) which his hands have sent forth, and the disbeliever will say: "Woe to me! Would that I were dust!"

source: والنازعات غرقا
en: By those (angels) who pull out (the souls of the disbelievers and the wicked) with great violence.

source: والناشطات نشطا
en: By those (angels) who gently take out (the souls of the believers).

source: والسابحات سبحا
en: And by those that swim along (i.e. angels or planets in their orbits).

source: فالسابقات سبقا
en: And by those that press forward as in a race (i.e. the angels or stars or the horses).

source: فالمدبرات أمرا
en: And by those angels who arrange to do the Commands of their Lord, (so verily, you disbelievers will be called to account).

source: يوم ترجف الراجفة
en: On the Day (when the first blowing of the Trumpet is blown), the earth and the mountains will shake violently (and everybody will die).

source: تتبعها الرادفة
en: The second blowing of the Trumpet follows it (and everybody will be resurrected).

source: قلوب يومئذ واجفة
en: (Some) hearts that Day will shake with fear and anxiety.

source: أبصارها خاشعة
en: Their eyes will be downcast.

source: يقولون أإنا لمردودون في الحافرة
en: They say: "Shall we indeed be returned to (our) former state of life?

source: أإذا كنا عظاما نخرة
en: "Even after we are crumbled bones?"

source: قالوا تلك إذا كرة خاسرة
en: They say: "It would in that case, be a return with loss!"

source: فإنما هي زجرة واحدة
en: But it will be only a single Zajrah [shout (i.e., the second blowing of the Trumpet)], (See Verse 37:19).

source: فإذا هم بالساهرة
en: When behold, they find themselves on the surface of the earth alive after their death,

source: هل أتاك حديث موسى
en: Has there come to you the story of Musa (Moses)?

source: إذ ناداه ربه بالواد المقدس طوى
en: When his Lord called him in the sacred valley of Tuwa,

source: فقل هل لك إلى أن تزكى
en: And say to him: "Would you purify yourself (from the sin of disbelief by becoming a believer)?"

source: وأهديك إلى ربك فتخشى
en: "And that I guide you to your Lord, so you should fear Him?"

source: فأراه الآية الكبرى
en: Then [Musa (Moses)] showed him the great sign (miracles).

source: فكذب وعصى
en: But [Fir'aun (Pharaoh)] belied and disobeyed.

source: ثم أدبر يسعى
en: Then he turned his back, striving (against Allah).

source: فحشر فنادى
en: Then he gathered (his people) and cried aloud,

source: فقال أنا ربكم الأعلى
en: Saying: "I am your lord, most high."

source: فأخذه الله نكال الآخرة والأولى
en: So Allah, seized him with punishment for his last and first transgression. [Tafsir At-Tabari]

source: إن في ذلك لعبرة لمن يخشى
en: Verily, in this is an instructive admonition for whosoever fears Allah.

source: أأنتم أشد خلقا أم السماء بناها
en: Are you more difficult to create or is the heaven that He constructed?

source: رفع سمكها فسواها
en: He raised its height, and has perfected it.

source: وأغطش ليلها وأخرج ضحاها
en: Its night He covers with darkness and its forenoon He brings out (with light)

source: والأرض بعد ذلك دحاها
en: And after that He spread the earth,

source: أخرج منها ماءها ومرعاها
en: And brought forth therefrom its water and its pasture.

source: والجبال أرساها
en: And the mountains He has fixed firmly,

source: متاعا لكم ولأنعامكم
en: (To be) a provision and benefit for you and your cattle.

source: فإذا جاءت الطامة الكبرى
en: But when there comes the greatest catastrophe (i.e. the Day of Recompense) -

source: يوم يتذكر الإنسان ما سعى
en: The Day when man shall remember what he strove for.

source: وبرزت الجحيم لمن يرى
en: And Hell-fire shall be made apparent in full view for (every) one who sees.

source: فأما من طغى
en: Then for him who transgressed all bounds, (in disbelief, oppression and evil deeds of disobedience to Allah).

source: وآثر الحياة الدنيا
en: And preferred the life of this world (by following his evil desires and lusts),

source: فإن الجحيم هي المأوى
en: Verily, his abode will be Hell-fire;

source: وأما من خاف مقام ربه ونهى النفس عن الهوى
en: But as for him who feared standing before his Lord, and restrained himself from impure evil desires and lusts.

source: فإن الجنة هي المأوى
en: Verily, Paradise will be his abode.

source: يسألونك عن الساعة أيان مرساها
en: They ask you (O Muhammad صلى الله عليه وسلم) about the Hour - when will be its appointed time?

source: فيم أنت من ذكراها
en: You have no knowledge to say anything about it.

source: إلى ربك منتهاها
en: To your Lord belongs (the knowledge of) the term thereof?

source: إنما أنت منذر من يخشاها
en: You (O Muhammad صلى الله عليه وسلم) are only a warner for those who fear it,

source: كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها
en: The Day they see it, (it will be) as if they had not tarried (in this world) except an afternoon or a morning.

source: عبس وتولى
en: (The Prophet صلى الله عليه وسلم) frowned and turned away.

source: أن جاءه الأعمى
en: Because there came to him the blind man (i.e. 'Abdullah bin Umm-Maktum, who came to the Prophet صلى الله عليه وسلم while he was preaching to one or some of the Quraish chiefs).

source: وما يدريك لعله يزكى
en: And how can you know that he might become pure (from sins)?

source: أو يذكر فتنفعه الذكرى
en: Or he might receive admonition, and the admonition might profit him?

source: أما من استغنى
en: As for him who thinks himself self-sufficient,

source: فأنت له تصدى
en: To him you attend;

source: وما عليك ألا يزكى
en: What does it matter to you if he will not become pure (from disbelief: you are only a Messenger, your duty is to convey the Message of Allah).

source: وأما من جاءك يسعى
en: But as to him who came to you running,

source: وهو يخشى
en: And is afraid (of Allah and His punishment).

source: فأنت عنه تلهى
en: Of him you are neglectful and divert your attention to another,

source: كلا إنها تذكرة
en: Nay, (do not do like this); indeed it (this Qur'an) is an admonition.

source: في صحف مكرمة
en: (It is) in Records held (greatly) in honour (Al-Lauh Al-Mahfuz),

source: مرفوعة مطهرة
en: Exalted (in dignity), purified,

source: بأيدي سفرة
en: In the hands of scribes (angels).

source: كرام بررة
en: Honourable and obedient.

source: قتل الإنسان ما أكفره
en: Be cursed (the disbelieving) man! How ungrateful he is!

source: من أي شيء خلقه
en: From what thing did He create him?

source: من نطفة خلقه فقدره
en: From Nutfah (male and female semen drops) He created him and then set him in due proportion.

source: ثم السبيل يسره
en: Then He makes the Path easy for him.

source: ثم أماته فأقبره
en: Then He causes him to die and puts him in his grave.

source: ثم إذا شاء أنشره
en: Then when it is His Will, He will resurrect him (again).

source: كلا لما يقض ما أمره
en: Nay, but (man) has not done what He commanded him.

source: فلينظر الإنسان إلى طعامه
en: Then let man look at his food:

source: أنا صببنا الماء صبا
en: We pour forth water in abundance.

source: ثم شققنا الأرض شقا
en: And We split the earth in clefts.

source: فأنبتنا فيها حبا
en: And We cause therein the grain to grow,

source: وعنبا وقضبا
en: And grapes and clover plants (i.e. green fodder for the cattle),

source: وزيتونا ونخلا
en: And olives and date-palms,

source: وحدائق غلبا
en: And gardens dense with many trees,

source: وفاكهة وأبا
en: And fruits and herbage

source: فإذا جاءت الصاخة
en: Then when there comes As-Sakhkhah (the second blowing of the Trumpet on the Day of Resurrection)

source: يوم يفر المرء من أخيه
en: That Day shall a man flee from his brother,

source: وأمه وأبيه
en: And from his mother and his father,

source: وصاحبته وبنيه
en: And from his wife and his children.

source: لكل امرئ منهم يومئذ شأن يغنيه
en: Everyman that Day will have enough to make him careless of others.

source: وجوه يومئذ مسفرة
en: Some faces that Day will be bright (true believers of Islamic Monotheism),

source: ضاحكة مستبشرة
en: Laughing, rejoicing at good news (of Paradise).

source: ووجوه يومئذ عليها غبرة
en: And other faces, that Day, will be dust-stained.

source: ترهقها قترة
en: Darkness will cover them.

source: أولئك هم الكفرة الفجرة
en: Such will be the Kafarah (disbelievers in Allah, in His Oneness, and in His Messenger Muhammad صلى الله عليه وسلم, etc.), the Fajarah (wicked evil doers).

source: إذا الشمس كورت
en: When the sun is wound round and its light is lost and is overthrown.

source: وإذا النجوم انكدرت
en: And when the stars fall.

source: وإذا الجبال سيرت
en: And when the mountains are made to pass away;

source: وإذا العشار عطلت
en: And when the pregnant she-camels are neglected;

source: وإذا الوحوش حشرت
en: And when the wild beasts are gathered together.

source: وإذا البحار سجرت
en: And when the seas become as blazing Fire or overflow.

source: وإذا النفوس زوجت
en: And when the souls are joined with their bodies, (the good with the good and the bad with the bad).

source: وإذا الموءودة سئلت
en: And when the female (infant) buried alive (as the pagan Arabs used to do) is questioned:

source: بأي ذنب قتلت
en: For what sin, was she killed?

source: وإذا الصحف نشرت
en: And when the (written) pages [of deeds (good and bad) of every person] are laid open.

source: وإذا السماء كشطت
en: And when the heaven is stripped off and taken away from its place;

source: وإذا الجحيم سعرت
en: And when Hell-fire is set ablaze.

source: وإذا الجنة أزلفت
en: And when Paradise is brought near.

source: علمت نفس ما أحضرت
en: (Then) every person will know what he has brought (of good and evil).

source: فلا أقسم بالخنس
en: So verily, I swear by the planets that recede (i.e. disappear during the day and appear during the night).

source: الجوار الكنس
en: And by the planets that move swiftly and hide themselves.

source: والليل إذا عسعس
en: And by the night as it departs.

source: والصبح إذا تنفس
en: And by the dawn as it brightens.

source: ذي قوة عند ذي العرش مكين
en: Owner of power, (and high rank) with (Allah), the Lord of the Throne,
